# Importing libraries and loading Datasets

In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/the-global-ai-ml-data-science-salary-for-2025/salaries.csv
/kaggle/input/data-science-salaries-2023/ds_salaries.csv
/kaggle/input/data-science-salaries-2025/salaries.csv
/kaggle/input/datascience-salaries-2024/DataScience_salaries_2024.csv
/kaggle/input/data-science-salary-2021-to-2023/Data Science Salary 2021 to 2023.csv

In [2]:
# Import necessary libraries
import numpy as np  # Import NumPy for handling numerical operations
import pandas as pd  # Import Pandas for data manipulation and analysis
import warnings  # Import Warnings to suppress unnecessary warnings

# Suppress warning messages
warnings.filterwarnings("ignore")

# Import matplotlib for data visualization
import matplotlib.pyplot as plt

In [3]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df1 = pd.read_csv("/kaggle/input/data-science-salaries-2025/salaries.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
YEAR_TO_START = 2020
df1 = df1.dropna()
df1['work_year'] = df1['work_year'].astype(int)
df1 = df1[df1['work_year']>=YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df1.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df1.sample(5)

(105434, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
2619,2025,MI,FT,Data Scientist,120000,USD,120000,US,0,US,M
23950,2025,SE,FT,Engineer,227950,USD,227950,US,0,US,M
23214,2025,SE,FT,Research Scientist,251000,USD,251000,US,0,US,M
33963,2024,MI,FT,Systems Engineer,83597,USD,83597,US,0,US,L
4624,2025,SE,FT,Developer,173728,USD,173728,US,0,US,M

In [4]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df2 = pd.read_csv("/kaggle/input/the-global-ai-ml-data-science-salary-for-2025/salaries.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
df2 = df2.dropna()
df2['work_year'] = df2['work_year'].astype(int)
df2 = df2[df2['work_year']>=YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df2.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df2.sample(5)

(88584, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
59890,2024,MI,FT,Machine Learning Engineer,194750,USD,194750,US,0,US,M
22870,2024,SE,FT,Data Architect,439800,PLN,109950,PL,0,PL,M
31831,2024,SE,FT,Data Analyst,123700,USD,123700,US,100,US,M
35195,2024,MI,FT,Engineer,107000,USD,107000,US,0,US,L
33827,2024,MI,FT,Software Engineer,98300,USD,98300,US,0,US,M

In [5]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df3 = pd.read_csv("/kaggle/input/datascience-salaries-2024/DataScience_salaries_2024.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
df3 = df3[df3['work_year']>= YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df3.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df3.sample(5)

(14838, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
11256,2024,SE,FT,Data Analyst,100000,USD,100000,US,0,US,M
7147,2023,SE,FT,Data Manager,145000,USD,145000,US,0,US,M
7641,2024,MI,FT,Data Engineer,140000,USD,140000,US,0,US,M
515,2023,SE,FT,Data Scientist,295490,USD,295490,US,0,US,M
8430,2023,SE,FT,Data Scientist,133200,USD,133200,US,100,US,M

In [6]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df4 = pd.read_csv("/kaggle/input/data-science-salary-2021-to-2023/Data Science Salary 2021 to 2023.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
df4 = df4[df4['work_year']>=YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df4.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df4.sample(5)

# No employee residence and remote ratio columns here, skipping

(3761, 9)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,company_location,company_size
3167,2022,SE,FT,Analytics Engineer,135000,USD,135000,US,M
1792,2022,EN,PT,Data Analyst,34320,USD,34320,US,S
3718,2020,MI,FT,Data Scientist,45760,USD,45760,US,S
3120,2022,SE,FT,Analytics Engineer,63000,USD,63000,US,M
2187,2022,MI,FT,Data Scientist,52000,EUR,54634,NL,S

In [7]:
# Read the CSV file containing data on data science salaries for 2023 into a DataFrame
df5 = pd.read_csv("/kaggle/input/data-science-salaries-2023/ds_salaries.csv").drop_duplicates()

# Filter the DataFrame to include only entries from the year YEAR_TO_START and later
df5 = df5[df5['work_year'] >= YEAR_TO_START]

# Print the shape of the filtered DataFrame to show the number of rows and columns
print(df5.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df5.sample(5)

(2584, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
2571,2022,EN,FT,Data Scientist,96000,CAD,73742,CA,100,CA,L
2170,2022,SE,FT,Data Analyst,105000,USD,105000,US,0,US,M
3251,2022,SE,FT,Data Engineer,160080,USD,160080,US,0,US,M
313,2023,SE,FT,Data Analyst,112000,USD,112000,US,100,US,M
2362,2022,SE,FT,Data Scientist,225000,USD,225000,US,0,US,M

## Concatenating DataFrames vertically

In [8]:
# This combines the rows of the DataFrames to create a new DataFrame
df = pd.concat([df1, df2, df3, df4, df5])

# Replace 'ML Engineer' with 'Machine Learning Engineer' in the 'job_title' column
df['job_title'].replace('ML Engineer', 'Machine Learning Engineer', inplace=True)

# Rename 'experience_level' based on a dictionary mapping
exp_dict = {'EN': 'Entry-level / Junior', 'MI': 'Mid-level / Intermediate', 'SE': 'Senior-level / Expert', 'EX': 'Executive-level / Director'}
df['experience_level'] = df['experience_level'].replace(exp_dict)

# Rename 'employment_type' based on a dictionary mapping
empl_dict = {'PT': 'Part-time', 'FT': 'Full-time', 'CT': 'Contract', 'FL': 'Freelance'}
df['employment_type'] = df['employment_type'].replace(empl_dict)

# Rename 'remote_ratio' based on a dictionary mapping
remote_dict = {0: 'No remote work (less than 20%)', 50: 'Partially remote', 100: 'Fully remote (more than 80%)'}
df['remote_ratio'] = df['remote_ratio'].replace(remote_dict)

# Rename 'company_size' based on a dictionary mapping
company_dict = {'S': 'Small', 'M': 'Medium', 'L': 'Large'}
df['company_size'] = df['company_size'].replace(company_dict)

# Removing duplicate rows from the concatenated DataFrame
# This helps ensure that each row is unique in the final DataFrame
df = df.drop_duplicates()

# Printing the shape of the resulting DataFrame
# This provides information about the number of rows and columns in the DataFrame
print(df.shape)

(55446, 11)

In [9]:
df["work_year"].value_counts()

work_year
2024    27870
2025    18813
2023     5913
2022     2213
2021      477
2020      160
Name: count, dtype: int64

# Data Visualization